Made the diagram interactive for users to understand it more properly
